Revit 2027 API
ParameterTypeId.RbsGbxmlOpeningType Property
 "Opening Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsGbxmlOpeningType { get; }
Public Shared ReadOnly Property RbsGbxmlOpeningType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsGbxmlOpeningType {
	ForgeTypeId^ get ();
}
static member RbsGbxmlOpeningType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace